xeon/20240731-2049-glibc-tuned/logs/pgbench-yes-32-1000-100/pgbench.log
pgbench (18devel)
transaction type: <builtin: select only>
scaling factor: 5
partition method: range
partitions: 100
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 2694803
number of failed transactions: 0 (0.000%)
latency average = 0.118 ms
initial connection time = 31.735 ms
tps = 270317.174942 (without initial connection time)